#+TITLE: Tiles

#+STARTUP: inlineimages
#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE

* Observations

We have a much better idea about what it would mean for an implementation to be
correct: it must satisfy every one of our laws.

An /observation/ is a function "out" of our algebra.

#+BEGIN_SRC haskell :eval never
data Color deriving Eq

rasterize :: Int       -- resulting width
          -> Int       -- resulting height
          -> Tile
          -> [[Color]] -- pixels in row-major order
#+END_SRC

Defines what equality means for tiles through the rasterize function. Two tiles
are equal if they produce the same image under rasterize. Laws specify how
operations interact with rasterize.

#+BEGIN_EXAMPLE
-- Law: equality
∀ (t1 :: Tile) (t2 :: Tile).
  (∀ (w :: Int) (h :: Int).
    rasterize w h t1 = rasterize w h t2) => t1 = t2

-- NOTE: the universal quantification of the predicate
-- (∀ (w :: Int) (h :: Int). rasterize w h t1 = rasterize w h t2)
#+END_EXAMPLE

#+BEGIN_QUOTE
Our design isn’t complete until we have given laws that constrain the
observation of the algebra. For example, there is absolutely nothing in our
equations that prevent us from mixing up cw and ccw.
#+END_QUOTE

#+BEGIN_EXAMPLE
-- Law: rasterize/flipV
-- Meaning: flipV in rasterized form should reverse the rows
∀ (t :: Tile) (w :: Int) (h :: Int).
  rasterize w h (flipV t) = reverse (rasterize w h t)

-- Law: rasterize/flipH
-- Meaning: flipH in rasterized form should reverse the pixels in each rows
∀ (t :: Tile) (w :: Int) (h :: Int).
  rasterize w h (flipH t) = map reverse (rasterize w h t)

-- Law: rasterize/above
-- Meaning: above in rasterized form should be the concatenation of the 2 rasterized tiles each taking half of the height
∀ (t1 :: Tile) (t2 :: Tile) (w :: Int) (h :: Int).
  rasterize w h (above t1 t2) = rasterize w (div h 2) t1 <> rasterize w (div h 2) t2

-- Law: rasterize/beside
-- NOTE: transpose will convert the representation from array of rows into an array of columns
∀ (t1 :: Tile) (t2 :: Tile) (w :: Int) (h :: Int).
  rasterize w h (beside t1 t2) =
    transpose $
      transpose (rasterize (div w 2) h t1) <>
        transpose (rasterize (di w 2) h t2)

-- Law: rasterize/cw
∀ (t :: Tile) (w :: Int) (h :: Int).
  rasterize w h (cw t) = fmap reverse (transpose (rasterize h w t))
#+END_EXAMPLE

Exercise: Give a specification for the observation of ~ccw~

#+BEGIN_EXAMPLE
-- Law: rasterize/ccw
∀ (t :: Tile) (w :: Int) (h :: Int).
  rasterize w h (ccw t) = reverse (transpose (rasterize h w t))
#+END_EXAMPLE

Practical demonstration

#+BEGIN_SRC haskell
import Data.List

type Tile = [[Int]]

tile :: Tile = [[1,2],[3,4],[5,6]]

:{
cw :: Tile -> Tile
cw = (map reverse) . transpose

ccw :: Tile -> Tile
ccw = reverse . transpose
:}

tile
cw tile
(cw . cw) tile
(cw . cw . cw) tile
(cw . cw . cw) tile == ccw tile
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
[[1,2],[3,4],[5,6]]
[[5,3,1],[6,4,2]]
[[6,5],[4,3],[2,1]]
[[2,4,6],[1,3,5]]
True
#+end_EXAMPLE

We only have left ~color~ and ~beside~

#+BEGIN_EXAMPLE
-- Law: rasterize/color
∀ (r :: Double) (g :: Double) (b :: Double) (a :: Double).
  rasterize w h (color r g b a) = replicate h (replicate w (rgba r g b a))

-- where
-- rgba :: Double -> Double -> Double -> Double -> Color
#+END_EXAMPLE

* Generalization

Are we ready to implement? Not quite! We should ask if our design is /overfit/
(meaning: does it carry any unnecessary baggage, or ask unnecessarily strong
constraints).

NOTE: ~color~ and ~behind~ are the only ones that require any notion of colorful
pixels.

We will make the ~Tile a~ a /Functor/ and to separate the operators we can make
the "space" operators to work on ~Tile a~ and the "color" operators to work on
~Tile Color~

#+BEGIN_SRC haskell :eval never
data Tile a deriving Functor
data Color deriving Eq

rasterize :: Int -> Int -> Tile a -> [[a]]

cw :: Tile a -> Tile a
ccw :: Tile a -> Tile a
beside :: Tile a -> Tile a -> Tile a
above :: Tile a -> Tile a -> Tile a
flipH :: Tile a -> Tile a
flipV :: Tile a -> Tile a
quad :: Tile a -> Tile a -> Tile a -> Tile a -> Tile a
swirl :: Tile a -> Tile a

color :: Double -> Double -> Double -> Double -> Tile Color
empty :: Tile Color
behind :: Tile Color -> Tile Color -> Tile Color
#+END_SRC

#+BEGIN_QUOTE
An interesting perspective to take on observations is that they are
transformations from an algebra into some other object.
#+END_QUOTE

We can view ~rasterize~ as ~rasterize :: Tile a -> (Int -> Int -> [[a]])~

Can we also make ~Tile a~ an /Applicative Functor/? What kind of semantic can we
give to ~Applicative~ instance? NOTE: we should preserve the ~Tile~ dimension,
so the applicative should pair two tiles on a per-pixel basis.

In Haskell to have this behavior of ~Applicative~ on ~List~ you need to use the
~ZipList~ "type wrapper"

#+BEGIN_SRC haskell
import Control.Applicative

-- the Applicative defined on List will peform the cartesian product
-- [(+1) 3, (+1) 4, (+2) 3, (+2) 4]
[(+1), (+2)] <*> [3, 4]

-- the Applicative defined on ZipList will apply a function to the respective value
-- [(+1) 3, (+2) 4]
getZipList $ ZipList [(+1), (+2)] <*> ZipList [3, 4]
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
[4,5,5,6]
[4,6]
#+end_EXAMPLE

By defining ~rasterize' :: Int -> Int -> Tile a -> Compose ZipList ZipList a~ we
can define the semantics of our applicative

#+BEGIN_EXAMPLE
-- Law: rasterize/ap
∀ (w :: Int) (h :: Int) (t1 :: Tile (a -> b)) (t2 :: Tile a).
  rasterize' w h (t1 <*> t2) = rasterize' w h t1 <*> rasterize' w h t2
#+END_EXAMPLE

What we are saying here is that the semantic of the ~Applicative~ instance of
~Tile a~ should have the "same observable effect" of the ~Applicative~ instance
of ~ZipList~ applied on the rasterized output.

Equation of this general form are known as /homomorphisms/, and when specialized
over applicatives are called /applicative morphisms/. Our applicative morphism
shows that it preserves applicative structure (applicative over tiles <=>
applicative over pixels)

- Homomorphism :: is a structure-preserving map two algebraic structure of the
  same type.

#+BEGIN_QUOTE
The technique of "reasoning through the observations" is one of the most potent
ideas in this book, "The instance's observation follows the observation's
instance"
#+END_QUOTE

We can define ~invert :: Color -> Color~ to invert the individual color's
channels.

#+BEGIN_SRC haskell :eval never
-- Invert every pixel using the Functor instance of ~Tile a~
fmap invert $ color 1 0 1 1
fmap invert sandy

-- ~pure id~ will create a ~Tile id~
-- ~pure invert~ will create a ~Tile invert~
-- ~beside x y~ will create a tile where the half left has the ~id~ function, the half right the ~invert~ function
-- At the end the half left of sandy will remain the same, the half left will invert its pixels color
beside (pure id) (pure invert) <*> sandy
#+END_SRC

As a final touch we can generalize over color blending and rather than
hard-coding operations over ~Color~ we can implement the instance of ~Monoid~
for ~Color~ and constain the operation over something that implements ~Monoid~

#+BEGIN_SRC haskell :eval never
emtpy :: Monoid a => Tile a
behind :: Monoid a => Tile a -> Tile a
#+END_SRC

Where

#+BEGIN_EXAMPLE
-- Law: empty
empty = pure mempty

-- Law: behind
∀ (t1 :: Tile a) (t2 :: Tile a).
  behind t1 t2 = liftA2 (<>) t2 t1
#+END_EXAMPLE
